* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
define data 
local
1 vw view of ada-employees 
 2 name
  
end-define
read vw by name 
  display name
end-read
**
END
