* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE FUNCTION FATORIAL
  RETURNS (I4)
DEFINE DATA 
PARAMETER
1  #ENE (I4) BY VALUE
LOCAL
1  #NLESSONE (I2)
END-DEFINE
**
IF (#ENE EQ 0)
  FATORIAL := 1
ELSE
  #NLESSONE := #ENE - 1
  FATORIAL  := #ENE * FATORIAL(< #NLESSONE >)
END-IF  
*
END-FUNCTION
*
END